Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType
A choice of two reference points for one end of a constraint driving the length of
a RebarShapeSegment.
Remarks:
The RebarShapeSegmentEndReferenceType of a constraint is meaningful only
when the bend is
right or
obtuse.
If the bend is
acute,
the reference type is ignored.
Since:
2012
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType.Exterior
Refers to the farthest point on the arc of the bend. Assuming the
bend is 90 degrees or more, an Exterior constraint will be longer than a
Straight constraint by an amount equal to the bend radius.

Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType.Straight
Refers to the end of the straight part of the segment: the point where
the bend begins.